from oop_ui import *

h = 'Текст заголовка'
b1 = [
        ('Данные', 'в', 'виде'), 
        ('списка', 'кортежей'), 
        ('со', 'строками'),
]
b2 = [
        ('Данные', 'в', 'виде'), 
        ('списка', 'кортежей'), 
        ('со', 'строками', 'еще один вариант'),
]

m = [
        ('Список',), 
        ('элементов', 'меню'), 
        ('который', 'может', 'быть'), 
        ('разбит', 'на любое количество колонок')
]


s = Screen(
        header = h,
        body = [b1 , b2],
        menu = m, cols = 5
)

s.display()
